from django.http import Http404, HttpResponse
from django.shortcuts import render

# Створіть ваші представлення
def index(request):
    return render(request, "singlepage/index.html")

# Справжні тексти будуть довші, але ми покажемо їх так, щоб зекономити місце
texts = ["Життя - це безцінний дар, який треба цінувати кожну мить. Кожен день пропонує нам нові виклики та можливості для зростання та розвитку, тому ми повинні використовувати їх на повну.", "Смерть - це невід'ємна частина життя, яка завершує наш час на землі. Хоча ця тема може бути несподіваною та неприємною для багатьох з нас, але вона нагадує нам, що потрібно жити кожен день так, наче він останній.", "Любов - це найвища форма емоції, яка здатна перетворити наше життя. Вона може викликати радість, щастя та відчуття спокою, а також надихати нас на створення щось більшого, ніж ми можемо собі уявити. Любов - це не тільки емоція, а й дія, яка може допомогти нам змінити світ навколо себе на краще."]

def section(request, num):
    if 1 <= num <= 3:
        return HttpResponse(texts[num - 1])
    else:
        raise Http404("Відсутній розділ")